[NoCoverage] BlockStatement
src/main/utils/SectionsTableUtils.jsx:3:43
 import { toast } from "react-toastify";
 
-export function objectToAxiosParams(data) {
-  return {
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      enrollCd: data.enrollCd.toString(),
-      psId: data.psId.toString(),
-    },
-  };
-}
+export function objectToAxiosParams(data) {}
 
 export function onSuccess(response) {

[NoCoverage] BlockStatement
src/main/utils/SectionsTableUtils.jsx:14:37
   };
 }
 
-export function onSuccess(response) {
-  if (response.length < 3) {
-    toast(
-      `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
-    );
-  } else {
-    toast(
-      `Course ${response[0].enrollCd} replaced old section ${response[2].enrollCd} with new section ${response[1].enrollCd}`,
-    );
-  }
-}
+export function onSuccess(response) {}
 
 export function onError(error) {

[NoCoverage] ConditionalExpression
src/main/utils/SectionsTableUtils.jsx:15:7
 }
 
 export function onSuccess(response) {
-  if (response.length < 3) {
+  if (true) {
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,

[NoCoverage] ConditionalExpression
src/main/utils/SectionsTableUtils.jsx:15:7
 }
 
 export function onSuccess(response) {
-  if (response.length < 3) {
+  if (false) {
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,

[NoCoverage] StringLiteral
src/main/utils/SectionsTableUtils.jsx:21:7
     );
   } else {
     toast(
-      `Course ${response[0].enrollCd} replaced old section ${response[2].enrollCd} with new section ${response[1].enrollCd}`,
+      ``,
     );
   }

[NoCoverage] BlockStatement
src/main/utils/SectionsTableUtils.jsx:26:32
   }
 }
 
-export function onError(error) {
-  console.error("onError: error=", error);
-  const message =
-    error.response.data?.message ||
-    `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
-  toast.error(message);
-}
+export function onError(error) {}
 
