[Killed] BooleanLiteral
main/components/Sections/SectionsTable.jsx:28:7
 import AddToScheduleModal from "main/components/PersonalSchedules/AddToScheduleModal";
 
 export default function SectionsTable({ sections, schedules = [] }) {
-  if (!(schedules instanceof Array)) {
+  if (schedules instanceof Array) {
     throw new Error("schedules prop must be an array");
   }
killedBy: SectionsTable tests Section Table tests Error checking that schedules is an array works; SectionSearchesIndexPageNotLoggedIn tests renders without crashing; SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:32:7
     throw new Error("schedules prop must be an array");
   }
 
-  if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
+  if (true) {
     throw new Error(
       "schedules prop must be an array of objects with an 'id' property",
killedBy: SectionSearchesIndexPageNotLoggedIn tests renders without crashing; SectionsTable tests Section Table tests renders without crashing for empty table; SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: schedules prop must be an array of objects with an 'id' property

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:34:7
 
   if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
     throw new Error(
-      "schedules prop must be an array of objects with an 'id' property",
+      "",
     );
   }
killedBy: SectionsTable tests Section Table tests Error checking that schedules is an array of objects with id property works
statusReason: expected [Function] to throw error including 'schedules prop must be an array of ob…' but got ''

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:57:11
 
   const columns = [
     {
-      id: "expander", // Unique ID for the expander column
+      id: "", // Unique ID for the expander column
       header: ({ table }) => (
         <button
killedBy: SectionSearchesIndexPageNotLoggedIn tests renders without crashing; SectionsTable tests Section Table tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:100:20
       // ),
     },
     {
-      accessorKey: "title",
+      accessorKey: "",
       header: "Title",
     },
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:144:15
       cell: ({ row }) => renderInfoLink(row, testid),
     },
     {
-      header: "Action",
+      header: "",
       id: "action",
       cell: ({ row }) => {
killedBy: SectionsTable tests Section Table tests Has the expected column headers and content
statusReason: Unable to find an element with the text: Action. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"
