[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:32:7
     throw new Error("schedules prop must be an array");
   }
 
-  if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
+  if (true && !Object.hasOwn(schedules[0], "id")) {
     throw new Error(
       "schedules prop must be an array of objects with an 'id' property",
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Cannot convert undefined or null to object

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:145:11
     },
     {
       header: "Action",
-      id: "action",
+      id: "",
       cell: ({ row }) => {
         if (!currentUser.loggedIn) {
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded; SectionsTable tests Section Table tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header
