[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:59:67
     throw new Error("schedules prop must be an array");
   }
 
-  if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
-    throw new Error(
-      "schedules prop must be an array of objects with an 'id' property",
-    );
-  }
+  if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {}
 
   const { data: currentUser } = useCurrentUser();
killedBy: SectionsTable tests Section Table tests Error checking that schedules is an array of objects with id property works
statusReason: expected [Function] to throw an error
