[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:35:33
   };
 };
 
-const onSuccess = (response) => {
-  if (response.length < 3) {
-    toast(
-      `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
-    );
-  } else {
-    toast(
-      `Course ${response[0].enrollCd} replaced old section ${response[2].enrollCd} with new section ${response[1].enrollCd}`,
-    );
-  }
-};
+const onSuccess = (response) => {};
 
 const onError = (error) => {
killedBy: SectionsTable tests Add to schedule with axios mock - success scenarios displays success toast for new course creation
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] EqualityOperator
main/components/Sections/SectionsTable.jsx:36:7
 };
 
 const onSuccess = (response) => {
-  if (response.length < 3) {
+  if (response.length >= 3) {
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
killedBy: SectionsTable tests Add to schedule with axios mock - success scenarios displays success toast for new course creation
statusReason: Cannot read properties of undefined (reading 'enrollCd')

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:36:7
 };
 
 const onSuccess = (response) => {
-  if (response.length < 3) {
+  if (false) {
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
killedBy: SectionsTable tests Add to schedule with axios mock - success scenarios displays success toast for new course creation
statusReason: Cannot read properties of undefined (reading 'enrollCd')

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:50:5
 const onError = (error) => {
   console.error("onError: error=", error);
   const message =
-    error.response.data?.message ||
-    `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
+    true;
   toast.error(message);
 };
killedBy: SectionsTable tests Add to schedule with axios mock - error scenarios displays error toast with response message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course already exists in schedule' ]

Received: 

  1st vi.fn() call:

  [
-   "Course already exists in schedule",

[Killed] LogicalOperator
main/components/Sections/SectionsTable.jsx:50:5
 const onError = (error) => {
   console.error("onError: error=", error);
   const message =
-    error.response.data?.message ||
-    `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
+    error.response.data?.message && `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
   toast.error(message);
 };
killedBy: SectionsTable tests Add to schedule with axios mock - error scenarios displays error toast with response message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course already exists in schedule' ]

Received: 

  1st vi.fn() call:

  [
-   "Course already exists in schedule",

[Timeout] ObjectLiteral
main/components/Sections/SectionsTable.jsx:69:5
   const { data: currentUser } = useCurrentUser();
   const mutation = useBackendMutation(
     objectToAxiosParams,
-    { onSuccess, onError },
+    {},
     [],
   );

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:138:20
     },
     {
       header: "Status",
-      accessorKey: "status",
+      accessorKey: "",
       cell: ({ row }) => formatStatus(getSection(row)),
     },
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] BooleanLiteral
main/components/Sections/SectionsTable.jsx:180:13
       header: "Action",
       id: "action",
       cell: ({ row }) => {
-        if (!currentUser.loggedIn) {
+        if (currentUser.loggedIn) {
           return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
         } else if (!shouldShowAddToScheduleLink(row)) {
killedBy: SectionsTable tests Section Table tests Info link is correct; SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-9-no-action"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:182:55
       cell: ({ row }) => {
         if (!currentUser.loggedIn) {
           return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
-        } else if (!shouldShowAddToScheduleLink(row)) {
-          return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
-        }
+        } else if (!shouldShowAddToScheduleLink(row)) {}
         return (
           <div className="d-flex align-items-center gap-2">
killedBy: SectionsTable tests Section Table tests Info link is correct
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-9-no-action"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:194:23
                 addToScheduleCallback(section, schedule, mutation)
               }
               schedules={schedules}
-              testid={`${testid}-cell-row-${row.id}-col-action`}
+              testid={``}
             />
           </div>
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-add-to-schedule-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"
