[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:54:5
     localStartQuarter || quarters[0].yyyyq,
   );
   const [endQuarter, setEndQuarter] = useState(
-    localEndQuarter || quarters[0].yyyyq,
+    true,
   );
   const [subject, setSubject] = useState(
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: yyyyq.charAt is not a function

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:62:35
   const [courseNumber, setCourseNumber] = useState("");
   const [courseSuf, setCourseSuf] = useState("");
 
-  const submitAction = (event) => {
-    fetchJSON(event, {
-      startQuarter,
-      endQuarter,
-      subject,
-      courseNumber,
-      courseSuf,
-    });
-  };
+  const submitAction = (event) => {};
 
   const handleCourseNumberOnChange = (event) => {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response; CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests when I click submit, the right stuff happens
statusReason: expected 0 to be greater than or equal to 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:72:49
     });
   };
 
-  const handleCourseNumberOnChange = (event) => {
-    const rawCourse = event.target.value;
-    setCourseSuf(getSuffix(rawCourse));
-    setCourseNumber(getCourseNumber(rawCourse));
-  };
+  const handleCourseNumberOnChange = (event) => {};
 
   const {
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests when I select a course number without suffix, the state for course number changes
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^ANTH 24$/
Received:
  ANTH

[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:132:18
                 {`For example: '16' or '130A'; omit the subject area prefix.`}
               </Form.Text>
               <Form.Control.Feedback type="invalid">
-                {errors.CourseOverTimeSearchCourseNumber &&
-                  "Course Number is required. "}
+                {errors.CourseOverTimeSearchCourseNumber || "Course Number is required. "}
                 {errors.CourseOverTimeSearchCourseNumber?.type === "pattern" &&
                   "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm test for form validations on CourseNumber validates course number format
statusReason: Unable to find an element with the text: /Course number should be a 1 to 3 digit number, optionally followed by up to two letters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
