[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:24:39
 import { yyyyqToQyy } from "main/utils/quarterUtilities";
 import AddToScheduleModal from "main/components/PersonalSchedules/AddToScheduleModal";
 
-const objectToAxiosParams = (data) => {
-  return {
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      enrollCd: data.enrollCd.toString(),
-      psId: data.psId.toString(),
-    },
-  };
-};
+const objectToAxiosParams = (data) => {};
 
 const onSuccess = (response) => {
killedBy: SectionsTable tests Add to schedule with axios mock - success scenarios displays success toast for new course creation
statusReason: expected undefined to deeply equal { url: '/api/courses/post', …(2) }

[Killed] EqualityOperator
main/components/Sections/SectionsTable.jsx:36:7
 };
 
 const onSuccess = (response) => {
-  if (response.length < 3) {
+  if (response.length <= 3) {
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
killedBy: SectionsTable tests Add to schedule with axios mock - success scenarios displays success toast for course replacement
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Course 30262 replaced old section 88888 with new section 99999",

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:36:7
 };
 
 const onSuccess = (response) => {
-  if (response.length < 3) {
+  if (true) {
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
killedBy: SectionsTable tests Add to schedule with axios mock - success scenarios displays success toast for course replacement
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Course 30262 replaced old section 88888 with new section 99999",

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:47:28
   }
 };
 
-const onError = (error) => {
-  console.error("onError: error=", error);
-  const message =
-    error.response.data?.message ||
-    `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
-  toast.error(message);
-};
+const onError = (error) => {};
 
 export default function SectionsTable({ sections, schedules = [] }) {
killedBy: SectionsTable tests Add to schedule with axios mock - error scenarios displays error toast with response message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course already exists in schedule' ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:50:5
 const onError = (error) => {
   console.error("onError: error=", error);
   const message =
-    error.response.data?.message ||
-    `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
+    false;
   toast.error(message);
 };
killedBy: SectionsTable tests Add to schedule with axios mock - error scenarios displays error toast with response message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course already exists in schedule' ]

Received: 

  1st vi.fn() call:

  [
-   "Course already exists in schedule",

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:51:5
   console.error("onError: error=", error);
   const message =
     error.response.data?.message ||
-    `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
+    ``;
   toast.error(message);
 };
killedBy: SectionsTable tests Add to schedule with axios mock - error scenarios displays generic error toast when no response message
statusReason: expected '' to contain 'An unexpected error occurred adding t…'

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:56:7
 };
 
 export default function SectionsTable({ sections, schedules = [] }) {
-  if (!(schedules instanceof Array)) {
+  if (false) {
     throw new Error("schedules prop must be an array");
   }
killedBy: SectionsTable tests Section Table tests Error checking that schedules is an array works
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:56:7
 };
 
 export default function SectionsTable({ sections, schedules = [] }) {
-  if (!(schedules instanceof Array)) {
+  if (true) {
     throw new Error("schedules prop must be an array");
   }
killedBy: SectionsTable tests Section Table tests Error checking that schedules is an array of objects with id property works
statusReason: expected [Function] to throw error including 'schedules prop must be an array of ob…' but got 'schedules prop must be an array'

[Killed] LogicalOperator
main/components/Sections/SectionsTable.jsx:60:7
     throw new Error("schedules prop must be an array");
   }
 
-  if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
+  if (schedules.length > 0 || !Object.hasOwn(schedules[0], "id")) {
     throw new Error(
       "schedules prop must be an array of objects with an 'id' property",
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing; SectionSearchesIndexPageNotLoggedIn tests renders without crashing; SectionsTable tests Section Table tests renders without crashing for empty table
statusReason: Cannot convert undefined or null to object

[Killed] BooleanLiteral
main/components/Sections/SectionsTable.jsx:60:31
     throw new Error("schedules prop must be an array");
   }
 
-  if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
+  if (schedules.length > 0 && Object.hasOwn(schedules[0], "id")) {
     throw new Error(
       "schedules prop must be an array of objects with an 'id' property",
killedBy: SectionsTable tests Section Table tests Error checking that schedules is an array of objects with id property works
statusReason: expected [Function] to throw an error

[Timeout] ArrayDeclaration
main/components/Sections/SectionsTable.jsx:70:5
   const mutation = useBackendMutation(
     objectToAxiosParams,
     { onSuccess, onError },
-    [],
+    ["Stryker was here"],
   );
 

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:73:66
     [],
   );
 
-  const addToScheduleCallback = (section, schedule, mutation) => {
-    const dataFinal = {
-      enrollCd: section.enrollCode,
-      psId: schedule,
-    };
-    mutation.mutate(dataFinal);
-  };
+  const addToScheduleCallback = (section, schedule, mutation) => {};
 
   const testid = "SectionsTable";
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expected "vi.fn()" to be called with arguments: [ { enrollCd: '30262', psId: 1 } ]

Number of calls: 0

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:81:18
     mutation.mutate(dataFinal);
   };
 
-  const testid = "SectionsTable";
+  const testid = "";
 
   const columns = [
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded; SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response; SectionSearchesIndexPageNotLoggedIn tests calls UCSB section search api correctly with 1 section response
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-quarter"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid=""

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:89:15
       header: ({ table }) => (
         <button
           data-testid={`${testid}-expand-all-rows`}
-          {...{
-            onClick: table.getToggleAllRowsExpandedHandler(),
-          }}
+          {...{}}
         >
           {table.getIsAllRowsExpanded() ? "➖" : "➕"}
killedBy: SectionsTable tests Section Table tests Expand all button works properly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ➖
Received:
  ➕

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:102:32
             data-testid={`${testid}-row-${row.index}-expand-button`}
             {...{
               onClick: row.getToggleExpandedHandler(),
-              style: { cursor: "pointer" },
+              style: { cursor: "" },
             }}
           >
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: expect(element).toHaveAttribute("style", "cursor: pointer;") // element.getAttribute("style") === "cursor: pointer;"

Expected the element to have attribute:
  style="cursor: pointer;"
Received:
  null

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:118:67
       header: "Quarter",
       accessorKey: "quarter",
       cell: ({ row }) =>
-        row.original.quarter ? yyyyqToQyy(row.original.quarter) : "",
+        row.original.quarter ? yyyyqToQyy(row.original.quarter) : "Stryker was here!",
     },
     {
killedBy: SectionsTable tests Section Table tests Info link is correct
statusReason: expect(element).toBeEmptyDOMElement()

Received:
  "Stryker was here!"

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:120:5
       cell: ({ row }) =>
         row.original.quarter ? yyyyqToQyy(row.original.quarter) : "",
     },
-    {
-      accessorKey: "courseId",
-      header: "Course ID",
-      cell: ({ row }) => (
-        <a
-          href={formatInfoLink(row)}
-          data-testid={`${testid}-row-${row.id}-col-courseId-link`}
-        >
-          {row.original.courseId}
-        </a>
-      ),
-    },
+    {},
     {
       accessorKey: "title",
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:121:20
         row.original.quarter ? yyyyqToQyy(row.original.quarter) : "",
     },
     {
-      accessorKey: "courseId",
+      accessorKey: "",
       header: "Course ID",
       cell: ({ row }) => (
killedBy: SectionSearchesIndexPageNotLoggedIn tests calls UCSB section search api correctly with 1 section response; SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Sections/SectionsTable.jsx:123:13
     {
       accessorKey: "courseId",
       header: "Course ID",
-      cell: ({ row }) => (
-        <a
-          href={formatInfoLink(row)}
-          data-testid={`${testid}-row-${row.id}-col-courseId-link`}
-        >
-          {row.original.courseId}
-        </a>
-      ),
+      cell: () => undefined,
     },
     {
killedBy: SectionSearchesIndexPageLoggedIn tests calls UCSB section search api correctly with 1 section response; SectionsTable tests Section Table tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  MATH 2A
Received:

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:142:15
       cell: ({ row }) => formatStatus(getSection(row)),
     },
     {
-      header: "Enrolled",
+      header: "",
       accessorKey: "enrolled",
       cell: ({ row }) => enrollmentFraction(row),
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element with the text: Enrolled. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:171:5
       header: "Enroll Code",
       cell: ({ row }) => getSectionField(row, "enrollCode"),
     },
-    {
-      header: "Info",
-      id: "info",
-      cell: ({ row }) => renderInfoLink(row, testid),
-    },
+    {},
     {
       header: "Action",
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing; SectionsTable.loggedOut tests Has the expected cell values when expanded; SectionsTable tests Section Table tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:179:26
     {
       header: "Action",
       id: "action",
-      cell: ({ row }) => {
-        if (!currentUser.loggedIn) {
-          return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
-        } else if (!shouldShowAddToScheduleLink(row)) {
-          return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
-        }
-        return (
-          <div className="d-flex align-items-center gap-2">
-            <AddToScheduleModal
-              section={getSection(row)}
-              quarter={getQuarter(row)}
-              onAdd={(section, schedule) =>
-                addToScheduleCallback(section, schedule, mutation)
-              }
-              schedules={schedules}
-              testid={`${testid}-cell-row-${row.id}-col-action`}
-            />
-          </div>
-        );
-      },
+      cell: ({ row }) => {},
     },
   ];
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded; SectionsTable tests Section Table tests Info link is correct
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:180:13
       header: "Action",
       id: "action",
       cell: ({ row }) => {
-        if (!currentUser.loggedIn) {
+        if (true) {
           return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
         } else if (!shouldShowAddToScheduleLink(row)) {
killedBy: SectionsTable tests Section Table tests Info link is correct
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-9-no-action"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:180:13
       header: "Action",
       id: "action",
       cell: ({ row }) => {
-        if (!currentUser.loggedIn) {
+        if (false) {
           return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
         } else if (!shouldShowAddToScheduleLink(row)) {
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
main/components/Sections/SectionsTable.jsx:182:20
       cell: ({ row }) => {
         if (!currentUser.loggedIn) {
           return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
-        } else if (!shouldShowAddToScheduleLink(row)) {
+        } else if (shouldShowAddToScheduleLink(row)) {
           return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
         }
killedBy: SectionsTable tests Section Table tests Info link is correct
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-9-no-action"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:182:20
       cell: ({ row }) => {
         if (!currentUser.loggedIn) {
           return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
-        } else if (!shouldShowAddToScheduleLink(row)) {
+        } else if (false) {
           return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
         }
killedBy: SectionsTable tests Section Table tests Info link is correct
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-9-no-action"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:183:37
         if (!currentUser.loggedIn) {
           return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
         } else if (!shouldShowAddToScheduleLink(row)) {
-          return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
+          return <span data-testid={``} />;
         }
         return (
killedBy: SectionsTable tests Section Table tests Info link is correct
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-9-no-action"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ArrowFunction
main/components/Sections/SectionsTable.jsx:190:22
             <AddToScheduleModal
               section={getSection(row)}
               quarter={getQuarter(row)}
-              onAdd={(section, schedule) =>
-                addToScheduleCallback(section, schedule, mutation)
+              onAdd={() => undefined
               }
               schedules={schedules}
killedBy: SectionsTable tests AddToScheduleModal interaction tests with mocked useBackendMutation Add button in modal works correctly
statusReason: expected "vi.fn()" to be called with arguments: [ { enrollCd: '30262', psId: 1 } ]

Number of calls: 0
