[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:6:25
 import { faInfoCircle } from "@fortawesome/free-solid-svg-icons";
 
 export const convertToFraction = (en1, en2) => {
-  return en1 != null && en2 != null ? `${en1}/${en2}` : "";
+  return en1 != null && true ? `${en1}/${en2}` : "";
 };
 
killedBy: section utils tests convertToFraction tests convertToFraction one null test 2
statusReason: expected '100/null' to be '' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:11:7
 
 // Takes a time location array and returns the locations
 export const formatLocation = (timeLocationArray) => {
-  try {
-    let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
-      res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
-      if (index + 1 < timeLocationArray.length) {
-        res += `, `;
-      }
-    }
-    return res;
-  } catch {
+  try {} catch {
     return "";
   }
killedBy: section utils tests formatLocation tests formatLocation test
statusReason: expected undefined to be 'LOC1 1, LOC2 2' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:13:68
 export const formatLocation = (timeLocationArray) => {
   try {
     let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
-      res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
-      if (index + 1 < timeLocationArray.length) {
-        res += `, `;
-      }
-    }
+    for (let index = 0; index < timeLocationArray.length; index++) {}
     return res;
   } catch {
killedBy: section utils tests formatLocation tests formatLocation test
statusReason: expected '' to be 'LOC1 1, LOC2 2' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:20:11
       }
     }
     return res;
-  } catch {
-    return "";
-  }
+  } catch {}
 };
 
killedBy: section utils tests formatLocation tests formatLocation null test
statusReason: expected undefined to be '' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:29:25
 export const formatDays = (timeLocationArray) => {
   try {
     let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
+    for (let index = 0; index >= timeLocationArray.length; index++) {
       res +=
         timeLocationArray[index].days !== null
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected '' to be 'M W, R F' // Object.is equality

[Killed] AssignmentOperator
src/main/utils/sectionUtils.jsx:30:7
   try {
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
-      res +=
-        timeLocationArray[index].days !== null
-          ? `${timeLocationArray[index].days}`
-          : "";
+      res -= timeLocationArray[index].days !== null ? `${timeLocationArray[index].days}` : "";
       if (
         index + 1 < timeLocationArray.length &&
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected NaN to be 'M W, R F' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:35:9
           ? `${timeLocationArray[index].days}`
           : "";
       if (
-        index + 1 < timeLocationArray.length &&
-        timeLocationArray[index].days !== null
+        false
       ) {
         res += `, `;
killedBy: section utils tests formatDays tests formatDays test 1
statusReason: expected 'M WR F' to be 'M W, R F' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:36:9
           : "";
       if (
         index + 1 < timeLocationArray.length &&
-        timeLocationArray[index].days !== null
+        true
       ) {
         res += `, `;
killedBy: section utils tests formatDays tests formatDays test 2
statusReason: expected ', R F' to be 'R F' // Object.is equality

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:62:12
     }
     return res;
   } catch {
-    return "";
+    return "Stryker was here!";
   }
 };
killedBy: section utils tests formatTime tests formatTime null test
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:68:7
 
 // Takes a instructors array and returns the instructors
 export const formatInstructors = (instructorArray) => {
-  try {
-    let res = "";
-    for (let index = 0; index < instructorArray.length; index++) {
-      res += `${instructorArray[index].instructor}`;
-      if (index + 1 < instructorArray.length) {
-        res += `, `;
-      }
-    }
-    return res;
-  } catch {
+  try {} catch {
     return "";
   }
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected undefined to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:70:66
 export const formatInstructors = (instructorArray) => {
   try {
     let res = "";
-    for (let index = 0; index < instructorArray.length; index++) {
-      res += `${instructorArray[index].instructor}`;
-      if (index + 1 < instructorArray.length) {
-        res += `, `;
-      }
-    }
+    for (let index = 0; index < instructorArray.length; index++) {}
     return res;
   } catch {
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected '' to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:72:11
     let res = "";
     for (let index = 0; index < instructorArray.length; index++) {
       res += `${instructorArray[index].instructor}`;
-      if (index + 1 < instructorArray.length) {
+      if (true) {
         res += `, `;
       }
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected 'HESPANHA J P, JOHN S, ' to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:72:11
     let res = "";
     for (let index = 0; index < instructorArray.length; index++) {
       res += `${instructorArray[index].instructor}`;
-      if (index + 1 < instructorArray.length) {
+      if (index + 1 <= instructorArray.length) {
         res += `, `;
       }
killedBy: section utils tests formatInstructors tests formatInstructors test
statusReason: expected 'HESPANHA J P, JOHN S, ' to be 'HESPANHA J P, JOHN S' // Object.is equality

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:87:42
 };
 
 // returns the course status based on cancel, closed, or full
-export const formatStatus = (section) => {
-  if (section.courseCancelled) {
-    return "Cancelled";
-  } else if (section.classClosed === "Y") {
-    return "Closed";
-  } else if (section.enrolledTotal >= section.maxEnroll) {
-    return "Full";
-  } else {
-    return "Open";
-  }
-};
+export const formatStatus = (section) => {};
 
 export const getQuarter = (row) =>
killedBy: section utils tests formatStatus tests formatStatus cancelled test
statusReason: expected undefined to be 'Cancelled' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:88:7
 
 // returns the course status based on cancel, closed, or full
 export const formatStatus = (section) => {
-  if (section.courseCancelled) {
+  if (false) {
     return "Cancelled";
   } else if (section.classClosed === "Y") {
killedBy: section utils tests formatStatus tests formatStatus cancelled test
statusReason: expected 'Open' to be 'Cancelled' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:100:3
 };
 
 export const getQuarter = (row) =>
-  row.depth === 0 ? row.original.quarter : row.getParentRow().original.quarter;
+  false ? row.original.quarter : row.getParentRow().original.quarter;
 
 export const formatInfoLink = (row) =>
killedBy: section utils tests formatInfoLink tests formatInfoLink works on a primary
statusReason: row.getParentRow is not a function

[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:128:40
 
 export const isPrimary = (row) => "primary" in row.original;
 
-export const isLectureWithNoSections = (row) =>
-  isPrimary(row) && row.original.subRows.length === 0;
+export const isLectureWithNoSections = () => undefined;
 
 export const shouldShowAddToScheduleLink = (row) =>
killedBy: section utils tests tests that depend on what kind of row it is isLectureWithNoSections true test
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/main/utils/sectionUtils.jsx:132:3
   isPrimary(row) && row.original.subRows.length === 0;
 
 export const shouldShowAddToScheduleLink = (row) =>
-  !isPrimary(row) || row.original.subRows.length === 0;
+  isPrimary(row) || row.original.subRows.length === 0;
 
 export function getSection(row) {
killedBy: section utils tests tests that depend on what kind of row it is shouldShowAddToScheduleLink returns correct values
statusReason: expected true to be false // Object.is equality
