[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:51:5
   const defaultSubjectArea = "ANTH";
 
   const [startQuarter, setStartQuarter] = useState(
-    localStartQuarter || quarters[0].yyyyq,
+    true,
   );
   const [endQuarter, setEndQuarter] = useState(
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: yyyyq.charAt is not a function

[Killed] EqualityOperator
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:134:18
               <Form.Control.Feedback type="invalid">
                 {errors.CourseOverTimeSearchCourseNumber &&
                   "Course Number is required. "}
-                {errors.CourseOverTimeSearchCourseNumber?.type === "pattern" &&
+                {errors.CourseOverTimeSearchCourseNumber?.type !== "pattern" &&
                   "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
               </Form.Control.Feedback>
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests when I click submit, the right stuff happens
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Course number should be a 1 to 3 digit number, optionally followed by up to two letters.
</div> instead
