[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryGraph.jsx:53:43
 };
 
 // Helper function to fill in for when 0 students got a grade
-const createCompleteGradeData = (data) => {
-  const gradeCounts = data.reduce((acc, item) => {
-    acc[item.grade] = item.count;
-    return acc;
-  }, {});
-
-  const totalCount = Object.values(gradeCounts).reduce(
-    (acc, count) => acc + count,
-    0,
-  );
-
-  return allGrades.map((grade) => ({
-    grade,
-    count: gradeCounts[grade] || 0,
-    percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
-  }));
-};
+const createCompleteGradeData = (data) => {};
 
 // Helper function to group data by `yyyyq` and `instructor`
killedBy: Grade history tests Correctly outputs data for one quarter; CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: expected +0 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
