[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryGraph.jsx:74:51
 
 // Helper function to group data by `yyyyq` and `instructor`
 // This will allow different instructors in the same quarter to be displayed seperatly
-const groupDataByQuarterAndInstructor = (data) => {
-  const groupedData = {};
-
-  // Added sort function to be able to display data by most recent quarter
-  data.sort((a, b) => {
-    const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
-    const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
-
-    if (yearA !== yearB) {
-      return yearB - yearA;
-    } else {
-      return qtrB - qtrA;
-    }
-  });
-
-  data.forEach((item) => {
-    const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) {
-      groupedData[key] = [];
-    }
-    groupedData[key].push(item);
-  });
-
-  return groupedData;
-};
+const groupDataByQuarterAndInstructor = (data) => {};
 
 // Component to render a single bar chart for a specific group of data
killedBy: Grade history tests renders without crashing for empty graph
statusReason: Cannot convert undefined or null to object
