[Killed] EqualityOperator
src/main/components/OurTable.jsx:102:8
           })}
         </tbody>
       </table>
-      {totalPages > 0 && (
+      {totalPages >= 0 && (
         <OurPagination
           activePage={page}
killedBy: CourseDetailsIndexPage tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Unable to find an element with the text: Course Details for CHEM 184 W22. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
