[Timeout] MethodExpression
src/main/components/SectionsTableBase.jsx:34:25
   // Pagination Logic: Slice the rows based on the current page
   const rows = table.getRowModel().rows;
   const totalPages = Math.ceil(rows.length / pageSize);
-  const rowsToDisplay = rows.slice((page - 1) * pageSize, page * pageSize);
+  const rowsToDisplay = rows;
 
   return (
