[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:12:9
 }) => {
   const nextPage = () => {
     const newPage = Math.min(activePage + 1, totalPages);
-    if (activePage !== newPage) {
+    if (false) {
       changePage(newPage);
     }
killedBy: OurTable tests OurTable component tests pagination works correctly; OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: Unable to find an element by: [data-testid="paginationTest-row-10"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="paginationTest"

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:22:30
       changePage(newPage);
     }
   };
-  const thisPage = (page) => {
-    if (activePage !== page) {
-      changePage(page);
-    }
-  };
+  const thisPage = (page) => {};
 
   const pageButton = (number) => (
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:23:30
     }
   };
   const thisPage = (page) => {
-    if (activePage !== page) {
-      changePage(page);
-    }
+    if (activePage !== page) {}
   };
 
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:23:9
     }
   };
   const thisPage = (page) => {
-    if (activePage !== page) {
+    if (false) {
       changePage(page);
     }
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:39:47
     </Pagination.Item>
   );
 
-  const generateSimplePaginationItems = () => {
-    const paginationItems = [];
-    for (let number = 1; number <= totalPages; number++) {
-      paginationItems.push(pageButton(number));
-    }
-    return paginationItems;
-  };
+  const generateSimplePaginationItems = () => {};
 
   const generateComplexPaginationItems = () => {
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected 2 to be 7 // Object.is equality

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:41:26
 
   const generateSimplePaginationItems = () => {
     const paginationItems = [];
-    for (let number = 1; number <= totalPages; number++) {
+    for (let number = 1; false; number++) {
       paginationItems.push(pageButton(number));
     }
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected 2 to be 7 // Object.is equality
