[Killed] ArrowFunction
src/main/components/OurTable.jsx:19:32
   const pageSize = 10;
 
   const newColumns = convertOldStyleColumnsToNewStyle(columns);
-  const memoizedData = useMemo(() => data, [data]);
+  const memoizedData = useMemo(() => undefined, [data]);
 
   const table = useReactTable({
killedBy: PersonalSchedulesTable tests renders without crashing for empty table with user not logged in
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ObjectLiteral
src/main/components/OurTable.jsx:21:31
   const newColumns = convertOldStyleColumnsToNewStyle(columns);
   const memoizedData = useMemo(() => data, [data]);
 
-  const table = useReactTable({
-    data: memoizedData,
-    columns: newColumns,
-    getCoreRowModel: getCoreRowModel(),
-    getSortedRowModel: getSortedRowModel(),
-    initialState: initialState,
-  });
+  const table = useReactTable({});
 
   const rows = table.getRowModel().rows;
killedBy: PersonalSchedulesTable tests renders without crashing for empty table with user not logged in
statusReason: table.options.getCoreRowModel is not a function

[Timeout] ArithmeticOperator
src/main/components/OurTable.jsx:30:32
   });
 
   const rows = table.getRowModel().rows;
-  const totalPages = Math.ceil(rows.length / pageSize);
+  const totalPages = Math.ceil(rows.length * pageSize);
   const rowsToDisplay = rows.slice((page - 1) * pageSize, page * pageSize);
 

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:31:36
 
   const rows = table.getRowModel().rows;
   const totalPages = Math.ceil(rows.length / pageSize);
-  const rowsToDisplay = rows.slice((page - 1) * pageSize, page * pageSize);
+  const rowsToDisplay = rows.slice((page - 1) / pageSize, page * pageSize);
 
   return (
killedBy: OurTable tests OurTable component tests pagination works correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <tr
  data-testid="paginationTest-row-0"
>
  <td
    data-testid="paginationTest-cell-row-0-col-col1"
  >

[Killed] ArithmeticOperator
src/main/components/OurTable.jsx:31:59
 
   const rows = table.getRowModel().rows;
   const totalPages = Math.ceil(rows.length / pageSize);
-  const rowsToDisplay = rows.slice((page - 1) * pageSize, page * pageSize);
+  const rowsToDisplay = rows.slice((page - 1) * pageSize, page / pageSize);
 
   return (
killedBy: OurTable tests OurTable component tests renders a table with three rows with correct test ids
statusReason: Unable to find an element by: [data-testid="testid-row-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="testid"

[Killed] StringLiteral
src/main/components/OurTable.jsx:75:31
         </thead>
         <tbody>
           {rowsToDisplay.map((row) => {
-            const rowTestId = `${testid}-row-${row.index}`;
+            const rowTestId = ``;
             return (
               <tr
killedBy: OurTable tests OurTable component tests renders a table with three rows with correct test ids
statusReason: Unable to find an element by: [data-testid="testid-row-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="testid"

[Killed] EqualityOperator
src/main/components/OurTable.jsx:102:8
           })}
         </tbody>
       </table>
-      {totalPages > 0 && (
+      {totalPages <= 0 && (
         <OurPagination
           activePage={page}
killedBy: OurTable tests OurTable component tests pagination works correctly
statusReason: Unable to find an element by: [data-testid="OurPagination-next"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="paginationTest"

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:102:8
           })}
         </tbody>
       </table>
-      {totalPages > 0 && (
-        <OurPagination
-          activePage={page}
-          changePage={setPage}
-          totalPages={totalPages}
-        />
-      )}
+      {true}
     </>
   );
killedBy: OurTable tests OurTable component tests pagination works correctly
statusReason: Unable to find an element by: [data-testid="OurPagination-next"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="paginationTest"

[Killed] StringLiteral
src/main/components/OurTable.jsx:142:13
     day: "numeric",
     hour: "numeric",
     minute: "numeric",
-    second: "numeric",
+    second: "",
     hour12: false,
     timeZone: "America/Los_Angeles",
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Value  out of range for Intl.DateTimeFormat options property second

[Killed] ObjectLiteral
src/main/components/OurTable.jsx:146:39
     hour12: false,
     timeZone: "America/Los_Angeles",
   };
-  const column = columnHelper.display({
-    header: label,
-    id: label,
-    cell: ({ cell }) => {
-      const date = new Date(getDate(cell));
-      const formattedDate = new Intl.DateTimeFormat("en-US", options).format(
-        date,
-      );
-      return <>{formattedDate}</>;
-    },
-  });
+  const column = columnHelper.display({});
 
   return column;
killedBy: JobsTable tests renders correctly for empty table
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
src/main/components/OurTable.jsx:149:25
   const column = columnHelper.display({
     header: label,
     id: label,
-    cell: ({ cell }) => {
-      const date = new Date(getDate(cell));
-      const formattedDate = new Intl.DateTimeFormat("en-US", options).format(
-        date,
-      );
-      return <>{formattedDate}</>;
-    },
+    cell: ({ cell }) => {},
   });
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
