[Killed] StringLiteral
src/main/components/SectionsTableBase.jsx:16:20
   const [page, setPage] = useState(1); // State for current page
   const pageSize = 10; // Limit to 10 items
 
-  const altColor = "#e3ebfc";
+  const altColor = "";
   const whiteColor = "#ffffff";
 
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders rows with alternating background colors correctly
statusReason: expected '' to be 'rgb(227, 235, 252)' // Object.is equality

[Killed] StringLiteral
src/main/components/SectionsTableBase.jsx:17:22
   const pageSize = 10; // Limit to 10 items
 
   const altColor = "#e3ebfc";
-  const whiteColor = "#ffffff";
+  const whiteColor = "";
 
   const table = useReactTable({
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders rows with alternating background colors correctly
statusReason: expected '' to be 'rgb(255, 255, 255)' // Object.is equality

[Killed] ObjectLiteral
src/main/components/SectionsTableBase.jsx:19:31
   const altColor = "#e3ebfc";
   const whiteColor = "#ffffff";
 
-  const table = useReactTable({
-    data: data,
-    columns: columns,
-    state: {
-      expanded,
-    },
-    onExpandedChange: setExpanded,
-    getSubRows: (row) => row.subRows, // This tells TanStack Table how to find sub-rows
-    getCoreRowModel: getCoreRowModel(),
-    getExpandedRowModel: getExpandedRowModel(), // Required for expansion
-  });
+  const table = useReactTable({});
 
   // Pagination Logic: Slice the rows based on the current page
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an empty table without crashing
statusReason: table.options.getCoreRowModel is not a function

[Killed] ObjectLiteral
src/main/components/SectionsTableBase.jsx:22:12
   const table = useReactTable({
     data: data,
     columns: columns,
-    state: {
-      expanded,
-    },
+    state: {},
     onExpandedChange: setExpanded,
     getSubRows: (row) => row.subRows, // This tells TanStack Table how to find sub-rows
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly; SectionsTable tests Section Table tests Info link is correct
statusReason: expected '➕' to be '➖' // Object.is equality

[Killed] ArithmeticOperator
src/main/components/SectionsTableBase.jsx:34:37
   // Pagination Logic: Slice the rows based on the current page
   const rows = table.getRowModel().rows;
   const totalPages = Math.ceil(rows.length / pageSize);
-  const rowsToDisplay = rows.slice((page - 1) * pageSize, page * pageSize);
+  const rowsToDisplay = rows.slice((page + 1) * pageSize, page * pageSize);
 
   return (
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly; SectionsTable tests Section Table tests Has the expected cell values when expanded
statusReason: Unable to find an element by: [data-testid="testid-row-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="testid"

[Killed] ArrowFunction
src/main/components/SectionsTableBase.jsx:42:40
         <thead>
           {table.getHeaderGroups().map((headerGroup) => (
             <tr key={headerGroup.id}>
-              {headerGroup.headers.map((header) => (
-                <th key={header.id} colSpan={header.colSpan}>
-                  {header.isPlaceholder
-                    ? null
-                    : flexRender(
-                        header.column.columnDef.header,
-                        header.getContext(),
-                      )}
-                </th>
-              ))}
+              {headerGroup.headers.map(() => undefined)}
             </tr>
           ))}
killedBy: SectionsTable tests Section Table tests Has the expected cell values when expanded; SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly
statusReason: Unable to find an element with the text: Quarter. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ArithmeticOperator
src/main/components/SectionsTableBase.jsx:58:32
         <tbody>
           {rowsToDisplay.map((row) => {
             const rowStyle = {
-              backgroundColor: row.index % 2 === 0 ? altColor : whiteColor,
+              backgroundColor: row.index * 2 === 0 ? altColor : whiteColor,
             };
             const rowId = `row-${row.id}`;
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders rows with alternating background colors correctly
statusReason: expected 'rgb(255, 255, 255)' to be 'rgb(227, 235, 252)' // Object.is equality

[Killed] EqualityOperator
src/main/components/SectionsTableBase.jsx:58:32
         <tbody>
           {rowsToDisplay.map((row) => {
             const rowStyle = {
-              backgroundColor: row.index % 2 === 0 ? altColor : whiteColor,
+              backgroundColor: row.index % 2 !== 0 ? altColor : whiteColor,
             };
             const rowId = `row-${row.id}`;
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders rows with alternating background colors correctly
statusReason: expected 'rgb(255, 255, 255)' to be 'rgb(227, 235, 252)' // Object.is equality

[Killed] ArrowFunction
src/main/components/SectionsTableBase.jsx:67:44
                 style={rowStyle}
                 data-testid={`${testid}-${rowId}`}
               >
-                {row.getVisibleCells().map((cell) => (
-                  <td
-                    key={cell.id}
-                    data-testid={`${testid}-cell-row-${cell.row.id}-col-${cell.column.id}`}
-                    style={{
-                      backgroundColor: "inherit",
-                      fontWeight: row.depth === 0 ? "bold" : "normal",
-                    }}
-                  >
-                    {flexRender(cell.column.columnDef.cell, cell.getContext())}
-                  </td>
-                ))}
+                {row.getVisibleCells().map(() => undefined)}
               </tr>
             );
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly
statusReason: Unable to find an element by: [data-testid="testid-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="testid"

[Killed] ObjectLiteral
src/main/components/SectionsTableBase.jsx:71:28
                   <td
                     key={cell.id}
                     data-testid={`${testid}-cell-row-${cell.row.id}-col-${cell.column.id}`}
-                    style={{
-                      backgroundColor: "inherit",
-                      fontWeight: row.depth === 0 ? "bold" : "normal",
-                    }}
+                    style={{}}
                   >
                     {flexRender(cell.column.columnDef.cell, cell.getContext())}
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly
statusReason: expect(element).toHaveAttribute("style", "background-color: inherit; font-weight: bold;") // element.getAttribute("style") === "background-color: inherit; font-weight: bold;"

Expected the element to have attribute:
  style="background-color: inherit; font-weight: bold;"
Received:
  null

[Killed] StringLiteral
src/main/components/SectionsTableBase.jsx:72:40
                     key={cell.id}
                     data-testid={`${testid}-cell-row-${cell.row.id}-col-${cell.column.id}`}
                     style={{
-                      backgroundColor: "inherit",
+                      backgroundColor: "",
                       fontWeight: row.depth === 0 ? "bold" : "normal",
                     }}
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly
statusReason: expect(element).toHaveAttribute("style", "background-color: inherit; font-weight: bold;") // element.getAttribute("style") === "background-color: inherit; font-weight: bold;"

Expected the element to have attribute:
  style="background-color: inherit; font-weight: bold;"
Received:
  style="font-weight: bold;"

[Killed] EqualityOperator
src/main/components/SectionsTableBase.jsx:73:35
                     data-testid={`${testid}-cell-row-${cell.row.id}-col-${cell.column.id}`}
                     style={{
                       backgroundColor: "inherit",
-                      fontWeight: row.depth === 0 ? "bold" : "normal",
+                      fontWeight: row.depth !== 0 ? "bold" : "normal",
                     }}
                   >
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly
statusReason: expect(element).toHaveAttribute("style", "background-color: inherit; font-weight: bold;") // element.getAttribute("style") === "background-color: inherit; font-weight: bold;"

Expected the element to have attribute:
  style="background-color: inherit; font-weight: bold;"
Received:
  style="background-color: inherit; font-weight: normal;"

[Killed] ConditionalExpression
src/main/components/SectionsTableBase.jsx:73:35
                     data-testid={`${testid}-cell-row-${cell.row.id}-col-${cell.column.id}`}
                     style={{
                       backgroundColor: "inherit",
-                      fontWeight: row.depth === 0 ? "bold" : "normal",
+                      fontWeight: false ? "bold" : "normal",
                     }}
                   >
killedBy: SectionsTableBase tests SectionsTableBase regular tests renders an full table correctly
statusReason: expect(element).toHaveAttribute("style", "background-color: inherit; font-weight: bold;") // element.getAttribute("style") === "background-color: inherit; font-weight: bold;"

Expected the element to have attribute:
  style="background-color: inherit; font-weight: bold;"
Received:
  style="background-color: inherit; font-weight: normal;"

[Killed] ArrowFunction
src/main/components/SectionsTableBase.jsx:86:40
         <tfoot>
           {table.getFooterGroups().map((footerGroup) => (
             <tr key={footerGroup.id}>
-              {footerGroup.headers.map((header) => (
-                <th key={header.id} colSpan={header.colSpan}>
-                  {header.isPlaceholder
-                    ? null
-                    : flexRender(
-                        header.column.columnDef.footer,
-                        header.getContext(),
-                      )}
-                </th>
-              ))}
+              {footerGroup.headers.map(() => undefined)}
             </tr>
           ))}
killedBy: SectionsTableBase tests SectionsTableBase tests for corner cases renders header with placeholder (null) when header.isPlaceholder is true
statusReason: Unable to find an element with the text: Real Footer. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="testid"

[Survived] EqualityOperator
src/main/components/SectionsTableBase.jsx:101:8
         </tfoot>
       </Table>
 
-      {totalPages > 0 && (
+      {totalPages <= 0 && (
         <OurPagination
           activePage={page}

[Survived] ConditionalExpression
src/main/components/SectionsTableBase.jsx:101:8
         </tfoot>
       </Table>
 
-      {totalPages > 0 && (
-        <OurPagination
-          activePage={page}
-          changePage={setPage}
-          totalPages={totalPages}
-        />
-      )}
+      {false}
     </>
   );
