[Killed] EqualityOperator
main/components/Utils/OurPagination.jsx:12:9
 }) => {
   const nextPage = () => {
     const newPage = Math.min(activePage + 1, totalPages);
-    if (activePage !== newPage) {
+    if (activePage === newPage) {
       changePage(newPage);
     }
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks); OurTable tests OurTable component tests pagination works correctly
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:12:9
 }) => {
   const nextPage = () => {
     const newPage = Math.min(activePage + 1, totalPages);
-    if (activePage !== newPage) {
+    if (true) {
       changePage(newPage);
     }
killedBy: OurPagination tests clicking next on last page does not call changePage
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      10,

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:16:26
       changePage(newPage);
     }
   };
-  const prevPage = () => {
-    const newPage = Math.max(activePage - 1, 1);
-    if (activePage !== newPage) {
-      changePage(newPage);
-    }
-  };
+  const prevPage = () => {};
   const thisPage = (page) => {
     if (activePage !== page) {
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  page-item

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:18:9
   };
   const prevPage = () => {
     const newPage = Math.max(activePage - 1, 1);
-    if (activePage !== newPage) {
+    if (true) {
       changePage(newPage);
     }
killedBy: OurPagination tests clicking prev on first page does not call changePage
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      1,

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:18:9
   };
   const prevPage = () => {
     const newPage = Math.max(activePage - 1, 1);
-    if (activePage !== newPage) {
+    if (false) {
       changePage(newPage);
     }
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  page-item

[Killed] EqualityOperator
main/components/Utils/OurPagination.jsx:23:9
     }
   };
   const thisPage = (page) => {
-    if (activePage !== page) {
+    if (activePage === page) {
       changePage(page);
     }
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:23:9
     }
   };
   const thisPage = (page) => {
-    if (activePage !== page) {
+    if (true) {
       changePage(page);
     }
killedBy: OurPagination tests clicking current page number does not call changePage
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      5,

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:31:15
   const pageButton = (number) => (
     <Pagination.Item
       key={number}
-      active={number === activePage}
+      active={false}
       onClick={() => thisPage(number)}
       data-testid={`${testId}-${number}`}
killedBy: OurPagination tests navigation: prev button works correctly
statusReason: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  page-item

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:41:58
 
   const generateSimplePaginationItems = () => {
     const paginationItems = [];
-    for (let number = 1; number <= totalPages; number++) {
-      paginationItems.push(pageButton(number));
-    }
+    for (let number = 1; number <= totalPages; number++) {}
     return paginationItems;
   };
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected 2 to be 7 // Object.is equality

[Killed] EqualityOperator
main/components/Utils/OurPagination.jsx:41:26
 
   const generateSimplePaginationItems = () => {
     const paginationItems = [];
-    for (let number = 1; number <= totalPages; number++) {
+    for (let number = 1; number < totalPages; number++) {
       paginationItems.push(pageButton(number));
     }
killedBy: OurPagination tests renders correctly for totalPages = 5 (less than or equal to 7)
statusReason: expected 6 to be 7 // Object.is equality

[Killed] EqualityOperator
main/components/Utils/OurPagination.jsx:54:9
     paginationItems.push(pageButton(1));
 
     // Case 1: activePage is near the beginning (1, 2, 3, 4)
-    if (activePage < 5) {
+    if (activePage >= 5) {
       paginationItems.push(pageButton(2));
       paginationItems.push(pageButton(3));
killedBy: OurPagination tests renders correctly for default values
statusReason: Found multiple elements by: [data-testid="OurPagination-1"]

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="page-link"
  data-testid="OurPagination-1"

[Killed] ConditionalExpression
main/components/Utils/OurPagination.jsx:54:9
     paginationItems.push(pageButton(1));
 
     // Case 1: activePage is near the beginning (1, 2, 3, 4)
-    if (activePage < 5) {
+    if (true) {
       paginationItems.push(pageButton(2));
       paginationItems.push(pageButton(3));
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 5 (middle range)
statusReason: Unable to find an element by: [data-testid="OurPagination-left-ellipsis"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] BlockStatement
main/components/Utils/OurPagination.jsx:67:43
       );
     }
     // Case 2: activePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (activePage > totalPages - 4) {
-      paginationItems.push(
-        <Pagination.Ellipsis
-          key="left-ellipsis"
-          data-testid={`${testId}-left-ellipsis`}
-        />,
-      );
-      paginationItems.push(pageButton(totalPages - 4));
-      paginationItems.push(pageButton(totalPages - 3));
-      paginationItems.push(pageButton(totalPages - 2));
-      paginationItems.push(pageButton(totalPages - 1));
-    }
+    else if (activePage > totalPages - 4) {}
     // Case 3: activePage is in the middle
     else {
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: expected 4 to be 9 // Object.is equality

[Killed] EqualityOperator
main/components/Utils/OurPagination.jsx:67:14
       );
     }
     // Case 2: activePage is near the end (totalPages - 3, totalPages - 2, totalPages - 1, totalPages)
-    else if (activePage > totalPages - 4) {
+    else if (activePage >= totalPages - 4) {
       paginationItems.push(
         <Pagination.Ellipsis
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 8 (middle range, next clicks)
statusReason: Unable to find an element by: [data-testid="OurPagination-7"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] ArithmeticOperator
main/components/Utils/OurPagination.jsx:75:39
         />,
       );
       paginationItems.push(pageButton(totalPages - 4));
-      paginationItems.push(pageButton(totalPages - 3));
+      paginationItems.push(pageButton(totalPages + 3));
       paginationItems.push(pageButton(totalPages - 2));
       paginationItems.push(pageButton(totalPages - 1));
killedBy: OurPagination tests renders correctly for totalPages = 12, activePage = 9 (near end)
statusReason: Unable to find an element by: [data-testid="OurPagination-9"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      class="pagination"
    >

[Killed] EqualityOperator
main/components/Utils/OurPagination.jsx:103:5
   };
 
   const generatePaginationItems = () =>
-    totalPages <= 7
+    totalPages > 7
       ? generateSimplePaginationItems()
       : generateComplexPaginationItems();
killedBy: OurPagination tests renders correctly for default values
statusReason: expected 12 to be 9 // Object.is equality
